Revit 2027 API
ParameterTypeId.FbxLightInitialColorTemperature Property
 "Initial Color Temperature"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightInitialColorTemperature { get; }
Public Shared ReadOnly Property FbxLightInitialColorTemperature As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightInitialColorTemperature {
	ForgeTypeId^ get ();
}
static member FbxLightInitialColorTemperature : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace